const signs = [
    {
        month: "𝙅𝙖𝙣𝙪𝙖𝙧𝙮",
        name: "𝔸𝕢𝕦𝕒𝕣𝕚𝕦𝕤♒",
        image: "assets/jan.jpg.jpg",
        description: "𝐢𝐧𝐭𝐞𝐥𝐥𝐞𝐜𝐭𝐮𝐚𝐥, 𝐢𝐧𝐝𝐞𝐩𝐞𝐧𝐝𝐞𝐧𝐭, 𝐚𝐧𝐝 𝐡𝐮𝐦𝐚𝐧𝐢𝐭𝐚𝐫𝐢𝐚𝐧  .... 𝘛𝘩𝘦𝘺 𝘢𝘳𝘦 𝘱𝘳𝘰𝘨𝘳𝘦𝘴𝘴𝘪𝘷𝘦 𝘵𝘩𝘪𝘯𝘬𝘦𝘳𝘴 𝘸𝘩𝘰 𝘷𝘢𝘭𝘶𝘦 𝘧𝘳𝘦𝘦𝘥𝘰𝘮 𝘢𝘯𝘥 𝘢𝘳𝘦 𝘥𝘳𝘢𝘸𝘯 𝘵𝘰 𝘪𝘯𝘵𝘦𝘭𝘭𝘦𝘤𝘵𝘶𝘢𝘭 𝘤𝘰𝘯𝘷𝘦𝘳𝘴𝘢𝘵𝘪𝘰𝘯𝘴 𝘢𝘯𝘥 𝘦𝘹𝘱𝘭𝘰𝘳𝘪𝘯𝘨 𝘯𝘦𝘸 𝘪𝘥𝘦𝘢𝘴. 𝘞𝘩𝘪𝘭𝘦 𝘵𝘩𝘦𝘺 𝘤𝘢𝘯 𝘣𝘦 𝘧𝘳𝘪𝘦𝘯𝘥𝘭𝘺 𝘢𝘯𝘥 𝘰𝘶𝘵𝘨𝘰𝘪𝘯𝘨, 𝘵𝘩𝘦𝘺 𝘢𝘭𝘴𝘰 𝘷𝘢𝘭𝘶𝘦 𝘵𝘩𝘦𝘪𝘳 𝘢𝘭𝘰𝘯𝘦 𝘵𝘪𝘮𝘦 𝘢𝘯𝘥 𝘤𝘢𝘯 𝘣𝘦 𝘶𝘯𝘱𝘳𝘦𝘥𝘪𝘤𝘵𝘢𝘣𝘭𝘦."
    },
    {
        month: "𝙁𝙚𝙗𝙧𝙪𝙖𝙧𝙮",
        name: "𝕋𝕒𝕣𝕦𝕣𝕦𝕤♉",
        image: "assets/feb.jpg.jpg",
        description: "𝘛𝘢𝘶𝘳𝘶𝘴, 𝘴𝘺𝘮𝘣𝘰𝘭𝘪𝘻𝘦𝘥 𝘣𝘺 𝘵𝘩𝘦 𝘣𝘶𝘭𝘭, 𝘪𝘴 𝘬𝘯𝘰𝘸𝘯 𝘧𝘰𝘳 𝘪𝘵𝘴 𝘨𝘳𝘰𝘶𝘯𝘥𝘦𝘥, 𝘴𝘦𝘯𝘴𝘶𝘢𝘭, 𝘢𝘯𝘥 𝘳𝘦𝘭𝘪𝘢𝘣𝘭𝘦 𝘯𝘢𝘵𝘶𝘳𝘦. 𝘛𝘩𝘦𝘺 𝘢𝘳𝘦 𝘰𝘧𝘵𝘦𝘯 𝘥𝘦𝘴𝘤𝘳𝘪𝘣𝘦𝘥 𝘢𝘴 𝘴𝘵𝘶𝘣𝘣𝘰𝘳𝘯, 𝘱𝘢𝘵𝘪𝘦𝘯𝘵, 𝘢𝘯𝘥 𝘥𝘦𝘷𝘰𝘵𝘦𝘥, 𝘷𝘢𝘭𝘶𝘪𝘯𝘨 𝘴𝘵𝘢𝘣𝘪𝘭𝘪𝘵𝘺 𝘢𝘯𝘥 𝘤𝘰𝘮𝘧𝘰𝘳𝘵. 𝘙𝘶𝘭𝘦𝘥 𝘣𝘺 𝘝𝘦𝘯𝘶𝘴, 𝘛𝘢𝘶𝘳𝘶𝘴 𝘢𝘱𝘱𝘳𝘦𝘤𝘪𝘢𝘵𝘦𝘴 𝘣𝘦𝘢𝘶𝘵𝘺, 𝘭𝘶𝘹𝘶𝘳𝘺, 𝘢𝘯𝘥 𝘵𝘩𝘦 𝘧𝘪𝘯𝘦𝘳 𝘵𝘩𝘪𝘯𝘨𝘴 𝘪𝘯 𝘭𝘪𝘧𝘦, 𝘰𝘧𝘵𝘦𝘯 𝘴𝘦𝘦𝘬𝘪𝘯𝘨 𝘱𝘭𝘦𝘢𝘴𝘶𝘳𝘦 𝘢𝘯𝘥 𝘪𝘯𝘥𝘶𝘭𝘨𝘪𝘯𝘨 𝘵𝘩𝘦𝘪𝘳 𝘴𝘦𝘯𝘴𝘦𝘴. "
    },
    {
        month: "𝙈𝙖𝙧𝙘𝙝",
        name: "ℂ𝕒𝕟𝕔𝕖𝕣♋",
        image: "assets/march.jpg.jpg",
        description: " 𝘢𝘳𝘦 𝘬𝘯𝘰𝘸𝘯 𝘧𝘰𝘳 𝘵𝘩𝘦𝘪𝘳 𝘦𝘮𝘰𝘵𝘪𝘰𝘯𝘢𝘭 𝘥𝘦𝘱𝘵𝘩, 𝘯𝘶𝘳𝘵𝘶𝘳𝘪𝘯𝘨 𝘯𝘢𝘵𝘶𝘳𝘦, 𝘢𝘯𝘥 𝘴𝘵𝘳𝘰𝘯𝘨 𝘪𝘯𝘵𝘶𝘪𝘵𝘪𝘰𝘯. 𝘛𝘩𝘦𝘺 𝘢𝘳𝘦 𝘥𝘦𝘦𝘱𝘭𝘺 𝘤𝘰𝘯𝘯𝘦𝘤𝘵𝘦𝘥 𝘵𝘰 𝘵𝘩𝘦𝘪𝘳 𝘧𝘦𝘦𝘭𝘪𝘯𝘨𝘴 𝘢𝘯𝘥 𝘵𝘩𝘦 𝘧𝘦𝘦𝘭𝘪𝘯𝘨𝘴 𝘰𝘧 𝘰𝘵𝘩𝘦𝘳𝘴, 𝘮𝘢𝘬𝘪𝘯𝘨 𝘵𝘩𝘦𝘮 𝘩𝘪𝘨𝘩𝘭𝘺 𝘦𝘮𝘱𝘢𝘵𝘩𝘦𝘵𝘪𝘤 𝘢𝘯𝘥 𝘤𝘰𝘮𝘱𝘢𝘴𝘴𝘪𝘰𝘯𝘢𝘵𝘦 𝘪𝘯𝘥𝘪𝘷𝘪𝘥𝘶𝘢𝘭𝘴. 𝘊𝘢𝘯𝘤𝘦𝘳𝘴 𝘷𝘢𝘭𝘶𝘦 𝘴𝘦𝘤𝘶𝘳𝘪𝘵𝘺, 𝘧𝘢𝘮𝘪𝘭𝘺, 𝘢𝘯𝘥 𝘩𝘰𝘮𝘦, 𝘰𝘧𝘵𝘦𝘯 𝘱𝘳𝘪𝘰𝘳𝘪𝘵𝘪𝘻𝘪𝘯𝘨 𝘵𝘩𝘦 𝘸𝘦𝘭𝘭-𝘣𝘦𝘪𝘯𝘨 𝘰𝘧 𝘵𝘩𝘦𝘪𝘳 𝘭𝘰𝘷𝘦𝘥 𝘰𝘯𝘦𝘴. "
    },
    {
        month: "𝘼𝙥𝙧𝙞𝙡",
        name: "𝕃𝕖𝕠♌",
        image: "assets/april.jpg.jpg",
        description: "𝐿𝑒𝑜, 𝑡ℎ𝑒 𝑓𝑖𝑓𝑡ℎ 𝑠𝑖𝑔𝑛 𝑜𝑓 𝑡ℎ𝑒 𝑧𝑜𝑑𝑖𝑎𝑐, 𝑖𝑠 𝑘𝑛𝑜𝑤𝑛 𝑓𝑜𝑟 𝑖𝑡𝑠 𝑏𝑜𝑙𝑑, 𝑤𝑎𝑟𝑚, 𝑎𝑛𝑑 𝑙𝑜𝑣𝑖𝑛𝑔 𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑡𝑦. 𝐿𝑒𝑜𝑠 𝑎𝑟𝑒 𝑛𝑎𝑡𝑢𝑟𝑎𝑙 𝑙𝑒𝑎𝑑𝑒𝑟𝑠, 𝑜𝑓𝑡𝑒𝑛 𝑡𝑎𝑘𝑖𝑛𝑔 𝑐ℎ𝑎𝑟𝑔𝑒 𝑎𝑛𝑑 𝑒𝑛𝑗𝑜𝑦𝑖𝑛𝑔 𝑡ℎ𝑒 𝑠𝑝𝑜𝑡𝑙𝑖𝑔ℎ𝑡. 𝑇ℎ𝑒𝑦 𝑎𝑟𝑒 𝑘𝑛𝑜𝑤𝑛 𝑓𝑜𝑟 𝑡ℎ𝑒𝑖𝑟 𝑐𝑜𝑛𝑓𝑖𝑑𝑒𝑛𝑐𝑒, 𝑔𝑒𝑛𝑒𝑟𝑜𝑠𝑖𝑡𝑦, 𝑎𝑛𝑑 𝑙𝑜𝑦𝑎𝑙𝑡𝑦, 𝑏𝑢𝑡 𝑐𝑎𝑛 𝑎𝑙𝑠𝑜 𝑏𝑒 𝑎𝑡𝑡𝑒𝑛𝑡𝑖𝑜𝑛-𝑠𝑒𝑒𝑘𝑖𝑛𝑔 𝑎𝑛𝑑 𝑠𝑡𝑢𝑏𝑏𝑜𝑟𝑛."
    },
    {
        month: "𝙈𝙖𝙮",
        name: "𝕍𝕚𝕣𝕘𝕠♍",
        image: "assets/may.jpg.jpg",
        description: "vi𝘳𝘨𝘰 𝘵𝘩𝘦 𝘴𝘪𝘹𝘵𝘩 𝘴𝘪𝘨𝘯 𝘰𝘧 𝘵𝘩𝘦 𝘻𝘰𝘥𝘪𝘢𝘤, 𝘪𝘴 𝘬𝘯𝘰𝘸𝘯 𝘧𝘰𝘳 𝘪𝘵𝘴 𝘱𝘳𝘢𝘤𝘵𝘪𝘤𝘢𝘭𝘪𝘵𝘺, 𝘪𝘯𝘵𝘦𝘭𝘭𝘪𝘨𝘦𝘯𝘤𝘦, 𝘢𝘯𝘥 𝘮𝘦𝘵𝘪𝘤𝘶𝘭𝘰𝘶𝘴 𝘯𝘢𝘵𝘶𝘳𝘦. 𝘝𝘪𝘳𝘨𝘰𝘴 𝘢𝘳𝘦 𝘰𝘧𝘵𝘦𝘯 𝘥𝘦𝘴𝘤𝘳𝘪𝘣𝘦𝘥 𝘢𝘴 𝘢𝘯𝘢𝘭𝘺𝘵𝘪𝘤𝘢𝘭, 𝘥𝘦𝘵𝘢𝘪𝘭-𝘰𝘳𝘪𝘦𝘯𝘵𝘦𝘥, 𝘢𝘯𝘥 𝘩𝘢𝘳𝘥𝘸𝘰𝘳𝘬𝘪𝘯𝘨 𝘪𝘯𝘥𝘪𝘷𝘪𝘥𝘶𝘢𝘭𝘴 𝘸𝘩𝘰 𝘴𝘵𝘳𝘪𝘷𝘦 𝘧𝘰𝘳 𝘱𝘦𝘳𝘧𝘦𝘤𝘵𝘪𝘰𝘯. 𝘛𝘩𝘦𝘺 𝘢𝘳𝘦 𝘬𝘯𝘰𝘸𝘯 𝘧𝘰𝘳 𝘵𝘩𝘦𝘪𝘳 𝘴𝘵𝘳𝘰𝘯𝘨 𝘴𝘦𝘯𝘴𝘦 𝘰𝘧 𝘳𝘦𝘴𝘱𝘰𝘯𝘴𝘪𝘣𝘪𝘭𝘪𝘵𝘺 𝘢𝘯𝘥 𝘵𝘩𝘦𝘪𝘳 𝘥𝘦𝘴𝘪𝘳𝘦 𝘵𝘰 𝘣𝘳𝘪𝘯𝘨 𝘰𝘳𝘥𝘦𝘳 𝘢𝘯𝘥 𝘴𝘵𝘳𝘶𝘤𝘵𝘶𝘳𝘦 𝘵𝘰 𝘵𝘩𝘦𝘪𝘳 𝘴𝘶𝘳𝘳𝘰𝘶𝘯𝘥𝘪𝘯𝘨𝘴."
    },
    {
        month: "𝙅𝙪𝙣𝙚",
        name: "𝕃𝕚𝕓𝕣𝕒♎",
        image: "assets/june.jpg.jpg",
        description: "𝘓𝘪𝘣𝘳𝘢, 𝘵𝘩𝘦 𝘴𝘦𝘷𝘦𝘯𝘵𝘩 𝘴𝘪𝘨𝘯 𝘰𝘧 𝘵𝘩𝘦 𝘻𝘰𝘥𝘪𝘢𝘤, 𝘪𝘴 𝘬𝘯𝘰𝘸𝘯 𝘧𝘰𝘳 𝘪𝘵𝘴 𝘩𝘢𝘳𝘮𝘰𝘯𝘪𝘰𝘶𝘴 𝘢𝘯𝘥 𝘴𝘰𝘤𝘪𝘢𝘣𝘭𝘦 𝘯𝘢𝘵𝘶𝘳𝘦. 𝘙𝘶𝘭𝘦𝘥 𝘣𝘺 𝘝𝘦𝘯𝘶𝘴, 𝘵𝘩𝘦 𝘱𝘭𝘢𝘯𝘦𝘵 𝘰𝘧 𝘭𝘰𝘷𝘦 𝘢𝘯𝘥 𝘣𝘦𝘢𝘶𝘵𝘺, 𝘓𝘪𝘣𝘳𝘢𝘴 𝘢𝘳𝘦 𝘰𝘧𝘵𝘦𝘯 𝘤𝘩𝘢𝘳𝘮𝘪𝘯𝘨, 𝘧𝘢𝘪𝘳-𝘮𝘪𝘯𝘥𝘦𝘥, 𝘢𝘯𝘥 𝘢𝘳𝘵𝘪𝘴𝘵𝘪𝘤. 𝘛𝘩𝘦𝘺 𝘢𝘳𝘦 𝘯𝘢𝘵𝘶𝘳𝘢𝘭 𝘱𝘦𝘢𝘤𝘦𝘮𝘢𝘬𝘦𝘳𝘴 𝘢𝘯𝘥 𝘥𝘪𝘱𝘭𝘰𝘮𝘢𝘵𝘴, 𝘷𝘢𝘭𝘶𝘪𝘯𝘨 𝘣𝘢𝘭𝘢𝘯𝘤𝘦, 𝘧𝘢𝘪𝘳𝘯𝘦𝘴𝘴, 𝘢𝘯𝘥 𝘢𝘦𝘴𝘵𝘩𝘦𝘵𝘪𝘤𝘴. 𝘞𝘩𝘪𝘭𝘦 𝘵𝘩𝘦𝘪𝘳 𝘥𝘦𝘴𝘪𝘳𝘦 𝘵𝘰 𝘱𝘭𝘦𝘢𝘴𝘦 𝘦𝘷𝘦𝘳𝘺𝘰𝘯𝘦 𝘤𝘢𝘯 𝘭𝘦𝘢𝘥 𝘵𝘰 𝘪𝘯𝘥𝘦𝘤𝘪𝘴𝘪𝘷𝘦𝘯𝘦𝘴𝘴, 𝘵𝘩𝘦𝘪𝘳 𝘦𝘮𝘱𝘢𝘵𝘩𝘺 𝘢𝘯𝘥 𝘤𝘩𝘢𝘳𝘮 𝘮𝘢𝘬𝘦 𝘵𝘩𝘦𝘮 𝘦𝘹𝘤𝘦𝘭𝘭𝘦𝘯𝘵 𝘧𝘳𝘪𝘦𝘯𝘥𝘴 𝘢𝘯𝘥 𝘱𝘢𝘳𝘵𝘯𝘦𝘳𝘴. "
    },
    {
        month: "𝙅𝙪𝙡𝙮",
        name: "𝕍𝕖𝕘𝕒 | 𝔻𝕖𝕟𝕖𝕓 | 𝔸𝕝𝕥𝕒𝕚𝕣",
        image: "assets/july.jpg.jpg",
        description: "𝘛𝘩𝘦 𝘚𝘶𝘮𝘮𝘦𝘳 𝘛𝘳𝘪𝘢𝘯𝘨𝘭𝘦 𝘪𝘴 𝘯𝘰𝘵 𝘢𝘴𝘴𝘰𝘤𝘪𝘢𝘵𝘦𝘥 𝘸𝘪𝘵𝘩 𝘢 𝘴𝘱𝘦𝘤𝘪𝘧𝘪𝘤 𝘻𝘰𝘥𝘪𝘢𝘤 𝘴𝘪𝘨𝘯 𝘰𝘳 𝘱𝘦𝘳𝘴𝘰𝘯𝘢𝘭𝘪𝘵𝘺 𝘵𝘺𝘱𝘦 𝘪𝘯 𝘢𝘴𝘵𝘳𝘰𝘭𝘰𝘨𝘺. 𝘐𝘵 𝘪𝘴 𝘢𝘯 𝘢𝘴𝘵𝘦𝘳𝘪𝘴𝘮, 𝘢 𝘨𝘳𝘰𝘶𝘱 𝘰𝘧 𝘴𝘵𝘢𝘳𝘴 𝘵𝘩𝘢𝘵 𝘧𝘰𝘳𝘮 𝘢 𝘳𝘦𝘤𝘰𝘨𝘯𝘪𝘻𝘢𝘣𝘭𝘦 𝘱𝘢𝘵𝘵𝘦𝘳𝘯 𝘪𝘯 𝘵𝘩𝘦 𝘴𝘬𝘺, 𝘴𝘱𝘦𝘤𝘪𝘧𝘪𝘤𝘢𝘭𝘭𝘺 𝘷𝘪𝘴𝘪𝘣𝘭𝘦 𝘥𝘶𝘳𝘪𝘯𝘨 𝘵𝘩𝘦 𝘴𝘶𝘮𝘮𝘦𝘳 𝘮𝘰𝘯𝘵𝘩𝘴 𝘪𝘯 𝘵𝘩𝘦 𝘕𝘰𝘳𝘵𝘩𝘦𝘳𝘯 𝘏𝘦𝘮𝘪𝘴𝘱𝘩𝘦𝘳𝘦. 𝘛𝘩𝘦 𝘵𝘳𝘪𝘢𝘯𝘨𝘭𝘦 𝘪𝘴 𝘮𝘢𝘥𝘦 𝘶𝘱 𝘰𝘧 𝘵𝘩𝘳𝘦𝘦 𝘣𝘳𝘪𝘨𝘩𝘵 𝘴𝘵𝘢𝘳𝘴: 𝘝𝘦𝘨𝘢, 𝘈𝘭𝘵𝘢𝘪𝘳, 𝘢𝘯𝘥 𝘋𝘦𝘯𝘦𝘣."
    },
    {
        month: "𝘼𝙜𝙪𝙨𝙩",
        name: "𝕊𝕒𝕘𝕚𝕥𝕥𝕒𝕣𝕚𝕦𝕤♐",
        image: "assets/agust.jpg.jpg",
        description: "Sagittarius individuals, born between November 22 and December 21, are known for their adventurous, optimistic, and honest personalities. They are driven by a love for freedom, exploration, and a thirst for knowledge, often seeking new experiences and philosophical insights. Ruled by Jupiter, they are naturally optimistic and enjoy intellectual stimulation and social gatherings."
    },
    {
        month: "𝙎𝙚𝙥𝙩𝙚𝙢𝙗𝙚𝙧",
        name: "ℂ𝕖𝕡𝕙𝕖𝕦𝕤",
        image: "assets/sep.jpg.jpg",
        description: "𝐶𝑒𝑝ℎ𝑒𝑢𝑠, 𝑖𝑛 𝐺𝑟𝑒𝑒𝑘 𝑚𝑦𝑡ℎ𝑜𝑙𝑜𝑔𝑦, 𝑖𝑠 𝑝𝑟𝑖𝑚𝑎𝑟𝑖𝑙𝑦 𝑘𝑛𝑜𝑤𝑛 𝑎𝑠 𝑡ℎ𝑒 𝑘𝑖𝑛𝑔 𝑜𝑓 𝐴𝑒𝑡ℎ𝑖𝑜𝑝𝑖𝑎 𝑎𝑛𝑑 𝑡ℎ𝑒 ℎ𝑢𝑠𝑏𝑎𝑛𝑑 𝑜𝑓 𝐶𝑎𝑠𝑠𝑖𝑜𝑝𝑒𝑖𝑎, 𝑎𝑠 𝑤𝑒𝑙𝑙 𝑎𝑠 𝑡ℎ𝑒 𝑓𝑎𝑡ℎ𝑒𝑟 𝑜𝑓 𝐴𝑛𝑑𝑟𝑜𝑚𝑒𝑑𝑎. 𝑊ℎ𝑖𝑙𝑒 𝑛𝑜𝑡 𝑡𝑦𝑝𝑖𝑐𝑎𝑙𝑙𝑦 𝑘𝑛𝑜𝑤𝑛 𝑓𝑜𝑟 𝑎 𝑠𝑝𝑒𝑐𝑖𝑓𝑖𝑐 𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑡𝑦 𝑡𝑟𝑎𝑖𝑡 𝑙𝑖𝑘𝑒 ℎ𝑖𝑠 𝑤𝑖𝑓𝑒'𝑠 𝑣𝑎𝑛𝑖𝑡𝑦, ℎ𝑒 𝑖𝑠 𝑜𝑓𝑡𝑒𝑛 𝑑𝑒𝑝𝑖𝑐𝑡𝑒𝑑 𝑎𝑠 𝑎 𝑙𝑜𝑦𝑎𝑙 𝑎𝑛𝑑 𝑐𝑎𝑟𝑖𝑛𝑔 𝑓𝑎𝑚𝑖𝑙𝑦 𝑚𝑎𝑛. 𝐻𝑒 𝑖𝑠 𝑎𝑙𝑠𝑜 𝑝𝑜𝑟𝑡𝑟𝑎𝑦𝑒𝑑 𝑎𝑠 𝑎 𝑘𝑖𝑛𝑔 𝑤ℎ𝑜 𝑖𝑠 𝑤𝑖𝑙𝑙𝑖𝑛𝑔 𝑡𝑜 𝑚𝑎𝑘𝑒 𝑠𝑎𝑐𝑟𝑖𝑓𝑖𝑐𝑒𝑠 𝑓𝑜𝑟 ℎ𝑖𝑠 𝑓𝑎𝑚𝑖𝑙𝑦 𝑎𝑛𝑑 𝑘𝑖𝑛𝑔𝑑𝑜𝑚."
    },
    {
        month: "𝙊𝙘𝙩𝙤𝙗𝙚𝙧",
        name: "ℂ𝕒𝕣𝕚𝕔𝕠𝕣𝕟𝕦𝕤♑",
        image: "assets/october.jpg.jpg",
        description: "Capricorns are known for being ambitious, disciplined, and practical, with a strong work ethic and a focus on achieving their goals. They are often seen as responsible, reliable, and determined individuals who value tradition and structure. However, they can also be reserved, sometimes stubborn, and may struggle with work-life balance"
    },
    {
        month: "𝙉𝙤𝙫𝙚𝙢𝙗𝙚𝙧",
        name: "𝕊𝕔𝕠𝕣𝕚𝕡𝕦𝕤♏",
        image: "assets/nove.jpg.jpg",
        description: "Scorpio, a water sign, is often characterized by intense passion, loyalty, and a deep emotional nature. They are known for their magnetic and charismatic personalities, but also for being secretive and possessive. Scorpios are intuitive, perceptive, and value depth and intensity in their relationships. "
    },
    {
        month: "𝘿𝙚𝙘𝙚𝙢𝙗𝙚𝙧",
        name: "𝔾𝕖𝕞𝕚𝕟𝕚♊",
        image: "assets/december.jpg.jpg",
        description: "𝑇ℎ𝑒𝑦 𝑎𝑟𝑒 𝑝𝑒𝑟𝑐𝑒𝑝𝑡𝑖𝑣𝑒, 𝑎𝑛𝑎𝑙𝑦𝑡𝑖𝑐𝑎𝑙, 𝑎𝑛𝑑 𝑜𝑓𝑡𝑒𝑛 𝑣𝑒𝑟𝑦 𝑓𝑢𝑛𝑛𝑦. 𝑇ℎ𝑒𝑦 ℎ𝑎𝑣𝑒 𝑎𝑛 𝑢𝑛𝑟𝑒𝑠𝑒𝑟𝑣𝑒𝑑, 𝑐ℎ𝑖𝑙𝑑𝑙𝑖𝑘𝑒 𝑐𝑢𝑟𝑖𝑜𝑠𝑖𝑡𝑦, 𝑎𝑙𝑤𝑎𝑦𝑠 𝑎𝑠𝑘𝑖𝑛𝑔 𝑛𝑒𝑤 𝑞𝑢𝑒𝑠𝑡𝑖𝑜𝑛𝑠. 𝐺𝑒𝑚𝑖𝑛𝑖𝑠 ℎ𝑎𝑣𝑒 𝑎𝑛 𝑢𝑛𝑐𝑎𝑛𝑛𝑦 𝑎𝑏𝑖𝑙𝑖𝑡𝑦 𝑡𝑜 𝑠𝑖𝑧𝑒 𝑢𝑝 𝑎 𝑝𝑒𝑟𝑠𝑜𝑛'𝑠 𝑐ℎ𝑎𝑟𝑎𝑐𝑡𝑒𝑟 𝑖𝑛 𝑎 𝑚𝑎𝑡𝑡𝑒𝑟 𝑜𝑓 𝑠𝑒𝑐𝑜𝑛𝑑𝑠, 𝑒𝑣𝑒𝑛 𝑖𝑓 𝑡ℎ𝑒𝑦 𝑜𝑛𝑙𝑦 𝑗𝑢𝑠𝑡 𝑚𝑒𝑡 𝑡ℎ𝑒𝑚. 𝐼𝑓 𝑠𝑜𝑚𝑒𝑜𝑛𝑒'𝑠 𝑏𝑙𝑢𝑓𝑓𝑖𝑛𝑔, 𝑡ℎ𝑒𝑦'𝑙𝑙 𝑏𝑒 𝑡ℎ𝑒 𝑓𝑖𝑟𝑠𝑡 𝑡𝑜 𝑛𝑜𝑡𝑖𝑐𝑒."
    }
];

const slider = document.getElementById('monthSlider');
const mainCard = document.getElementById('mainCard');
const mainImage = document.getElementById('mainImage');
const mainName = document.getElementById('mainName');
const mainDesc = document.getElementById('mainDesc');
const closeBtn = document.getElementById('closeCard');

signs.forEach(sign => {
    const card = document.createElement('div');
    card.className = 'month-card';
    card.innerHTML = `<img src="${sign.image}" />
      <div>${sign.month}</div>`;
    card.addEventListener('click', () => {
        mainImage.src = sign.image;
        mainName.textContent = sign.name;
        mainDesc.textContent = sign.description;
        mainCard.classList.remove('hidden');
    });
    slider.appendChild(card);
});


closeBtn.addEventListener('click', () => {
    mainCard.classList.add('hidden');
});
  